---
kind: method
id: M:Autodesk.Revit.DB.Architecture.MultistoryStairs.GetAllConnectedLevels
source: html/c6c09472-e44a-9bf5-6847-e4a0c2212d00.htm
---
# Autodesk.Revit.DB.Architecture.MultistoryStairs.GetAllConnectedLevels Method

Gets all connected level ids of this multistory stairs.

## Syntax (C#)
```csharp
public ISet<ElementId> GetAllConnectedLevels()
```

## Returns
The ids of connected levels.